import streamlit as st

r"""
##### Математическая модель

**Уравнение для функции тока**

Рассмотрим плоское стационарное потенциальное течение несжимаемой жидкости вокруг периодически расположенного пучка эллиптических цилиндров. Течение описывается уравнением Лапласа для функции тока $\psi$:

$$
-\nabla^2 \psi = 0, \quad x \in \Omega
$$

где $\Omega$ — область течения, исключающая цилиндры.

**Краевые условия на границе цилиндра**

$$
\psi(x) = 0, \quad x \in \gamma
$$

$\gamma$ — граница цилиндра (условие непротекания). 

Условие непротекания означает, что нормальная компонента скорости к поверхности цилиндра равна нулю.


**Условия периодичности**

1) **Условие периодичности по продольной координате**
$$
\psi(x_1 + L, x_2) = \psi(x_1, x_2)
$$

 где $L$ - продольный шаг.

**Смысл:** поле скорости повторяется через каждый продольный шаг $L$.

2) **Условие периодичности по поперечной координате**
$$
\psi(x_1, x_2 + H) = \psi(x_1, x_2) + \psi_0
$$

где $H$ — поперечный шаг, $\psi_0$ — расход на одну ячейку.

**Смысл:** при переходе к следующей ячейке в поперечном направлении функция тока увеличивается на величину расхода $\psi_0$, что обеспечивает сохранение потока через границы ячейки.

Расход на одну ячейку:
$$
\psi_0 = \int_0^H u_1(x) dx
$$

где $u_1$ — продольная компонента скорости. 

Скорость $u = \{u_\infty, 0\}$ на входе:
$$
\psi_0 = u_\infty H
$$

где $u_\infty$ — скорость набегающего потока.

**Конечно-элементная аппроксимация**

Ищем функцию $\psi(x) \in V$, такую что 

$$
\int_{\Omega} \nabla \psi(x) \cdot \nabla u dx = 0, \quad \forall u(x) \in V_0
$$

 - $V$ - пространство функций, удовлетворяющих периодическим условиям и условию $\psi = 0$ на границе цилиндра;
 - $V_0$ - пространство тестовых функций, удовлетворяющих тем же условиям периодичности, и обнуляющихся на границе цилиндра $\gamma$;

**Пространство функций**

------------------------------------------------------------------------------------------------------------------------------------------------------

$$
V = \{\psi \in \mathrm{H}^{1}(\Omega) | \psi = 0 \text{ на } \gamma, \psi(x_1 + L, x_2) = \psi(x_1, x_2), \psi(x_1, x_2 + H) = \psi(x_1, x_2) + \psi_0\}
$$

------------------------------------------------------------------------------------------------------------------------------------------------------

$$
V_0 = \{v \in \mathrm{H}^1(\Omega) | v = 0 \text{ на } \gamma, v(x_1 + L, x_2) = v(x_1, x_2), v(x_1, x_2 + H) = v(x_1, x_2)\}
$$ 

------------------------------------------------------------------------------------------------------------------------------------------------------

##### Верификация численного решения по значению циркулляции

$$
\oint_{\gamma} \frac{\partial \psi}{\partial n} (x) dx
$$

"""